<a href="https://colab.research.google.com/github/CamelGoong/Pandas_Practicing/blob/main/PART_6_Application_of_Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1 함수매핑

1-1 개별 원소에 함수 매핑

In [ ]:
# 시리즈 원소에 apply() 적용
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df['ten'] = 10

In [ ]:
# 사용자 함수 정의
def add_10(n):
  return n + 10

def add_two_obj(a, b):
  return a + b

# 함수 검사
print(add_10(5))
print(add_two_obj(1,3))

15
4

In [ ]:
# 시리즈 객체에 적용

df['sr1'] = df['age'].apply(add_10)

# 시리즈 객체와 숫자에 적용: 2개의 인수(시리즈 + 숫자)
df['sr2'] = df['age'].apply(add_two_obj, b = 10)

# lambda 함수의 활용: 시리즈 객체에 적용
df['sr3'] = df['age'].apply(lambda x : add_10(x)) # lambda 매개변수 : 표현식

df.head()

    age     fare  ten   sr1   sr2   sr3
0  22.0   7.2500   10  32.0  32.0  32.0
1  38.0  71.2833   10  48.0  48.0  48.0
2  26.0   7.9250   10  36.0  36.0  36.0
3  35.0  53.1000   10  45.0  45.0  45.0
4  35.0   8.0500   10  45.0  45.0  45.0

In [ ]:
df_map = df.applymap(add_10)

In [ ]:
df_map.head()

    age     fare  ten   sr1   sr2   sr3
0  32.0  17.2500   20  42.0  42.0  42.0
1  48.0  81.2833   20  58.0  58.0  58.0
2  36.0  17.9250   20  46.0  46.0  46.0
3  45.0  63.1000   20  55.0  55.0  55.0
4  45.0  18.0500   20  55.0  55.0  55.0

1-2 시리즈 객체에 함수 매핑

In [ ]:
# 데이터프레임에 apply(axis = 0) 적용

import seaborn as sns

titanic = sns.load_dataset("titanic")
df = titanic.loc[:, ['age', 'fare']]
print(df.head())

# 사용자 정의 함수
def missing_value(series):
  return series.isnull() # 불리언 series를 반환.

# 데이터프레임에 함수 적용 / 불리언 값을 반환하는 missing_value의 경우 들어가는 인자인 각 열에 대해서 series의 형태로 각 반환이 되고, 이것이 합쳐져서 궁극적으로는 dataframe의 형태로 반환이 됨.

result = df.apply(missing_value, axis = 0) #  axis = 0은 함수를 열로 사용하겠다는 의미
print(result.head())

result.info()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     891 non-null    bool
 1   fare    891 non-null    bool
dtypes: bool(2)
memory usage: 1.9 KB

In [ ]:
# 사용자 함수 정의
def min_max(x):
  return x.max()-x.min()

result = df.apply(min_max, axis = 0)
result.head()

age      79.5800
fare    512.3292
dtype: float64

In [ ]:
# 데이터프레임에 axis = 1로 apply 함수 적용

df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10

df['add'] = df.apply(lambda x : add_two_obj(x['age'], x['ten']), axis = 1)
df.head()

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

1-3 데이터프레임 객체에 함수 매핑

In [ ]:
df = titanic.loc[:, ['age', 'fare']]

# 각 열의 NaN 찾기
def missing_value(x):
  return x.isnull()

# 각 열의 NaN 갯수 반환
def missing_count(x):
  return missing_value(x).sum()

# 데이터프레임의 총 NaN 갯수
def total_number_missing(x):
  return missing_count(x).sum()

In [ ]:
result_df = df.pipe(missing_value)
result_df.head()

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [ ]:
result_series = df.pipe(missing_count)
result_series.head()

age     177
fare      0
dtype: int64

In [ ]:
result_value = df.pipe(total_number_missing)
print(result_value)

177

# 2 열 재구성

2-1 열 순서 변경

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:4, 'survived':'age']
df.head()

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [ ]:
# 열 순서 바꾸기

# 열 이름의 리스트 만들기
columns = list(df.columns.values) # 기존 column 이름
print(columns)

['survived', 'pclass', 'sex', 'age']

In [ ]:
# 열 이름을 알파벳 순으로 정렬
columns_sorted = sorted(columns)
print(columns_sorted)

['age', 'pclass', 'sex', 'survived']

In [ ]:
df_sorted = df[columns_sorted]
print(df_sorted)

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [ ]:
# 열 이름을 기존 순서의 역순으로 정렬하기

columns_reversed = reversed(columns)
df_reversed = df[columns_reversed]

print(df_reversed)

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [ ]:
# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기

columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

2-2 열 분리

In [ ]:
import pandas as pd

df = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/파이썬 머신러닝 판다스 데이터 분석/data/part6/주가데이터.xlsx", engine = 'openpyxl')
df.head()

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

In [ ]:
# astype(): 데이터 형변환

df['연월일'] = df['연월일'].astype('str')
dates = df['연월일'].str.split('-')
print(dates.head())

0     [2018, 07, 02]
1     [2018, 06, 29]
2     [2018, 06, 28]
3     [2018, 06, 27]
4     [2018, 06, 26]
5     [2018, 06, 25]
6     [2018, 06, 22]
7     [2018, 06, 21]
8     [2018, 06, 20]
9     [2018, 06, 19]
10    [2018, 06, 18]
11    [2018, 06, 15]
12    [2018, 06, 14]
13    [2018, 06, 12]
14    [2018, 06, 11]
15    [2018, 06, 08]
16    [2018, 06, 07]
17    [2018, 06, 05]
18    [2018, 06, 04]
19    [2018, 06, 01]
Name: 연월일, dtype: object

In [ ]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)

df.head()

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

# 3 필터링

3-1 불린 인덱싱

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

# 나이가 10대인 승객만 따로 선택
mask1 = (titanic.age >= 10) & (titanic.age < 20)

# 해당 조건을 만족하는 행들만 거를 것이므로
df_teenage = titanic.loc[mask1, :]

df_teenage

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
853,1,1,female,16.0,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
855,1,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
877,0,3,male,19.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [ ]:
# 나이가 10세미만이고 여성인 승객만 따로 선택
mask2 = (titanic.age < 10) & (titanic.sex == 'female')

mask2

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [ ]:
df_female_under10 = titanic.loc[mask2, :]
df_female_under10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False

In [ ]:
# 나이가 10세 미만 또는 60세 이상인 승객의 age, sex, alone 열 선택
mask3 = (titanic.age < 10) | (titanic.age >= 60)
mask3

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

In [ ]:
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
df_under10_morethan60.head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

3-2 isin() 메소드 활용

In [ ]:
mask3 = titanic['sibsp'] == 3
mask4 = titanic['sibsp'] == 4
mask5 = titanic['sibsp'] == 5

In [ ]:
df_boolean = titanic[mask3 | mask4 | mask5]
df_boolean.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
50,0,3,male,7.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False

In [ ]:
isin_filter = titanic['sibsp'].isin([3,4,5])
df_isin = titanic[isin_filter]
df_isin.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
50,0,3,male,7.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False

#4 데이터프레임 합치기

In [6]:
import pandas as pd

# 딕셔너리 객체로 판다스 데이터프레임 정의하기
df1 = pd.DataFrame({"a": ['a0', 'a1', 'a2', 'a3'],
                    "b": ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c1', 'c2', 'c3', 'c4'],
                    'd': ['d1', 'd2', 'd3', 'd4']},
                   index = [0, 1, 2, 3])
df2 = pd.DataFrame({"a": ['a2', 'a3', 'a4', 'a5'],
                    "b": ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                   index = [2, 3, 4, 5])

print(df1.head())
print(df2.head())

result1 = pd.concat([df1, df2]) # 이렇게 데이터프레임을 리스트로 넣어줘야 함.
result1

    a   b   c   d
0  a0  b0  c1  d1
1  a1  b1  c2  d2
2  a2  b2  c3  d3
3  a3  b3  c4  d4
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

    a   b   c   d
0  a0  b0  c1  d1
1  a1  b1  c2  d2
2  a2  b2  c3  d3
3  a3  b3  c4  d4
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [7]:
# ignore_index = True: 기존의 인덱스를 무시하고 새로운 인덱스를 설정.
result2 = pd.concat([df1, df2], ignore_index=True)
result2

    a   b   c   d
0  a0  b0  c1  d1
1  a1  b1  c2  d2
2  a2  b2  c3  d3
3  a3  b3  c4  d4
4  a2  b2  c2  d2
5  a3  b3  c3  d3
6  a4  b4  c4  d4
7  a5  b5  c5  d5

In [8]:
# concat의 axis의 default가 axis = 0(행으로 이어붙이기)이나, 이를 변경하면 열끼리 이어붙일 수 있음.
result3 = pd.concat([df1, df2], axis = 1)
result3

     a    b    c    d    a    b    c    d
0   a0   b0   c1   d1  NaN  NaN  NaN  NaN
1   a1   b1   c2   d2  NaN  NaN  NaN  NaN
2   a2   b2   c3   d3   a2   b2   c2   d2
3   a3   b3   c4   d4   a3   b3   c3   d3
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5

In [10]:
# join = 'inner' : 데이터프레임을 concat할 때, 행 인덱스의 교집합을 기준으로 합침.
result_in = pd.concat([df1, df2], join = "inner", axis = 1)
result_in

    a   b   c   d   a   b   c   d
2  a2  b2  c3  d3  a2  b2  c2  d2
3  a3  b3  c4  d4  a3  b3  c3  d3

In [21]:
# 데이터프레임 + 시리즈 연결

# 시리즈 만들기
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name = 'e')
sr2 = pd.Series(['f1', 'f2', 'f3'], name = 'f')
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name = 'g')

# 좌우로 연결하기
result4 = pd.concat([df1, sr1], axis = 1)
print(result4.head())

result5 = pd.concat([df2, sr2], axis = 1, sort = True)
print(result5)

    a   b   c   d   e
0  a0  b0  c1  d1  e0
1  a1  b1  c2  d2  e1
2  a2  b2  c3  d3  e2
3  a3  b3  c4  d4  e3
     a    b    c    d    f
0  NaN  NaN  NaN  NaN   f1
1  NaN  NaN  NaN  NaN   f2
2   a2   b2   c2   d2   f3
3   a3   b3   c3   d3  NaN
4   a4   b4   c4   d4  NaN
5   a5   b5   c5   d5  NaN

In [24]:
result6 = pd.concat([sr1, sr3], axis = 1)
print(result6)

result7 = pd.concat([sr1, sr3], axis = 0)
print(result7)

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3
0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

4-2 데이터프레임 병합

SQL의 join 명령과 비슷한 방식으로 어떤 기준에 의해 두 데이터프레임을 병합하는 개념

In [27]:
# 데이터프레임 합치기(merge)

import pandas as pd

# IPyhton 디스플레이 설정 변경
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_colwidth', 20)
pd.set_option('display.unicode.east_asian_width', True)

# 주식 데이터로 데이터프레임 만들기
df1 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/파이썬 머신러닝 판다스 데이터 분석/data/part6/stock price.xlsx', engine = 'openpyxl')
df2 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/파이썬 머신러닝 판다스 데이터 분석/data/part6/stock valuation.xlsx', engine = 'openpyxl')

print(df1)
print(df2)

       id    stock_name          value   price
0  128940      한미약품   59385.666667  421000
1  130960        CJ E&M   58540.666667   98900
2  138250    엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280  녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400    쿠쿠홀딩스  179204.666667  177500
8  199800          툴젠   -2514.333333  115400
9  204210  모두투어리츠    3093.333333    3475
       id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [28]:
# 데이터프레임 합치기 - 교집합: on = None과 how = inner의 옵션이 자동으로 적용
merge_inner = pd.merge(df1, df2)
print(merge_inner)

       id    stock_name          value   price          name           eps  \
0  130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
1  139480        이마트  239230.833333  254500        이마트  18268.166667
2  145990        삼양사   82750.000000   82000        삼양사   5741.000000
3  185750        종근당   40293.666667  100500        종근당   3990.333333
4  204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

      bps        per       pbr
0   54068  15.695091  1.829178
1  295780  13.931338  0.860437
2  108090  14.283226  0.758627
3   40684  25.185866  2.470259
4    5335  40.802348  0.651359

In [29]:
# 데이터프레임 합치기 - 합집합: on = 'id'와 how = 'outer'
merge_outer = pd.merge(df1, df2, on = 'id', how = 'outer')
print(merge_outer)

        id    stock_name          value     price              name  \
0   128940      한미약품   59385.666667  421000.0               NaN
1   130960        CJ E&M   58540.666667   98900.0            CJ E&M
2   138250    엔에스쇼핑   14558.666667   13200.0               NaN
3   139480        이마트  239230.833333  254500.0            이마트
4   142280  녹십자엠에스     468.833333   10200.0               NaN
5   145990        삼양사   82750.000000   82000.0            삼양사
6   185750        종근당   40293.666667  100500.0            종근당
7   192400    쿠쿠홀딩스  179204.666667  177500.0               NaN
8   199800          툴젠   -2514.333333  115400.0               NaN
9   204210  모두투어리츠    3093.333333    3475.0      모두투어리츠
10  136480           NaN            NaN       NaN              하림
11  138040           NaN            NaN       NaN    메리츠금융지주
12  161390           NaN            NaN       NaN        한국타이어
13  181710           NaN            NaN       NaN   NHN엔터테인먼트
14  207940           NaN            NaN       NaN  삼성바이오로직스

             eps       bps        per       pbr
0            NaN       NaN        NaN       NaN
1    6301.333333   54068.0  15.695091  1.829178
2            NaN       NaN        NaN       NaN
3   18268.166667  295780.0  13.931338  0.860437
4            NaN       NaN        NaN       NaN
5    5741.000000  108090.0  14.283226  0.758627
6    3990.333333   40684.0  25.185866  2.470259
7            NaN       NaN        NaN       NaN
8            NaN       NaN        NaN       NaN
9      85.166667    5335.0  40.802348  0.651359
10    274.166667    3551.0  11.489362  0.887074
11   2122.333333   14894.0   6.313806  0.899691
12   5648.500000   51341.0   7.453306  0.820007
13   2110.166667   78434.0  30.755864  0.827447
14   4644.166667   60099.0  89.790059  6.938551

In [33]:
# 왼쪽 데이터프레임 기준. 키 값 분리
merge_left = pd.merge(df1, df2, how = 'left', left_on = 'stock_name', right_on = 'name')
print(merge_left)

     id_x    stock_name          value   price      id_y          name  \
0  128940      한미약품   59385.666667  421000       NaN           NaN
1  130960        CJ E&M   58540.666667   98900  130960.0        CJ E&M
2  138250    엔에스쇼핑   14558.666667   13200       NaN           NaN
3  139480        이마트  239230.833333  254500  139480.0        이마트
4  142280  녹십자엠에스     468.833333   10200       NaN           NaN
5  145990        삼양사   82750.000000   82000  145990.0        삼양사
6  185750        종근당   40293.666667  100500  185750.0        종근당
7  192400    쿠쿠홀딩스  179204.666667  177500       NaN           NaN
8  199800          툴젠   -2514.333333  115400       NaN           NaN
9  204210  모두투어리츠    3093.333333    3475  204210.0  모두투어리츠

            eps       bps        per       pbr
0           NaN       NaN        NaN       NaN
1   6301.333333   54068.0  15.695091  1.829178
2           NaN       NaN        NaN       NaN
3  18268.166667  295780.0  13.931338  0.860437
4           NaN       NaN        NaN       NaN
5   5741.000000  108090.0  14.283226  0.758627
6   3990.333333   40684.0  25.185866  2.470259
7           NaN       NaN        NaN       NaN
8           NaN       NaN        NaN       NaN
9     85.166667    5335.0  40.802348  0.651359

In [35]:
# 오른쪽 데이터프레임 기준, 키 값 분리
merge_right = pd.merge(df1, df2, how = 'right', left_on = 'stock_name', right_on = 'name')
print(merge_right)

       id_x    stock_name          value     price    id_y              name  \
0  130960.0        CJ E&M   58540.666667   98900.0  130960            CJ E&M
1       NaN           NaN            NaN       NaN  136480              하림
2       NaN           NaN            NaN       NaN  138040    메리츠금융지주
3  139480.0        이마트  239230.833333  254500.0  139480            이마트
4  145990.0        삼양사   82750.000000   82000.0  145990            삼양사
5       NaN           NaN            NaN       NaN  161390        한국타이어
6       NaN           NaN            NaN       NaN  181710   NHN엔터테인먼트
7  185750.0        종근당   40293.666667  100500.0  185750            종근당
8  204210.0  모두투어리츠    3093.333333    3475.0  204210      모두투어리츠
9       NaN           NaN            NaN       NaN  207940  삼성바이오로직스

            eps     bps        per       pbr
0   6301.333333   54068  15.695091  1.829178
1    274.166667    3551  11.489362  0.887074
2   2122.333333   14894   6.313806  0.899691
3  18268.166667  295780  13.931338  0.860437
4   5741.000000  108090  14.283226  0.758627
5   5648.500000   51341   7.453306  0.820007
6   2110.166667   78434  30.755864  0.827447
7   3990.333333   40684  25.185866  2.470259
8     85.166667    5335  40.802348  0.651359
9   4644.166667   60099  89.790059  6.938551

In [38]:
# 불린 인덱싱과 결합하여 원하는 데이터 찾기
price = df1[df1['price'] < 50000]
price.head()

       id    stock_name         value  price
2  138250    엔에스쇼핑  14558.666667  13200
4  142280  녹십자엠에스    468.833333  10200
9  204210  모두투어리츠   3093.333333   3475

In [41]:
value = pd.merge(price, df2)
value.head()

,id,stock_name,value,price,name,eps,bps,per,pbr
0,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

4-3 데이터프레임 결합

In [46]:
# 데이터프레임 합치기(join)

import pandas as pd

       id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [50]:
df1 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/파이썬 머신러닝 판다스 데이터 분석/data/part6/stock price.xlsx', engine = 'openpyxl', index_col = 'id')
df2 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/파이썬 머신러닝 판다스 데이터 분석/data/part6/stock valuation.xlsx', engine = 'openpyxl', index_col = 'id')

df3 = df1.join(df2) # 이렇게 하면, how = 'left' 옵션이 기본으로 적용되어서 왼쪽의 행인덱스를 기준으로 결합됨.
df3

,stock_name,value,price,name,eps,bps,per,pbr
id,,,,,,,,
128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN
130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068.0,15.695091,1.829178
138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN
139480,이마트,239230.833333,254500,이마트,18268.166667,295780.0,13.931338,0.860437
142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN
145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090.0,14.283226,0.758627
185750,종근당,40293.666667,100500,종근당,3990.333333,40684.0,25.185866,2.470259
192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN
199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN
204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335.0,40.802348,0.651359

In [51]:
# 데이터프레임 결합(join) - 교집합

df4 = df1.join(df2, how = 'inner') # join이 행인덱스를 기준으로 합치는 것이므로, 이렇게 하면, 양쪽에 모두 있는 교집합 행인덱스를 기준으로 합쳐지게 됨.
df4

,stock_name,value,price,name,eps,bps,per,pbr
id,,,,,,,,
130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359